buttons = {
    'products'          :   '🛍محصولات',
    'basket'            :   '🛒سبد خرید',
    'profile'           :   '👤حساب کاربری',
    'help'              :   '❓راهنمای استفاده از ربات',
    'digital'           :   'کالای دیجیتال💻',
    'shoes'             :   'کفش 👞',
    'wearing'           :   'مد و پوشاک👕',
    'stationery'        :   'لوازم التحریر🖋️',
    'back'              :   'بازگشت',
    'editing'           :   'ویرایش📝',
    'deposit'           :   'افزایش موجودی💰',
    'adding'            :   'اضافه کردن محصول📦',
    'payment'           :   'پرداخت'
}

glass_button = {
    'add_to_basket'     :   'اضافه کردن به سبد خرید ✅',
    'cancel'            :   'لغو ❌',
    'next'              :   'بعدی ➡',
    'back'              :   'قبلی ⬅',
    'remove'            :   'حذف' 
}

message_ids = {
    'start_message'     :   6,
    'products'          :   2,
    'basket'            :   3,
    'profile'           :   4,
    'help'              :   5,
    'chooseing_cat'     :   13,
    'fun'               :   17,
    'error'             :   18,
    'help_text'         :   25,
    'adding_text'       :   26,
}

texts = {
    'zero_error'        :   'تعداد کالای انتخابی نمی‌تواند صفر باشد❗️',
    'cancel'            :   'عملیات لغو شد❗',
    'added'             :   'اضافه شد ✅',
    'no_product'        :   'محصولی با این کد در سبد خرید شما وجود ندارد.',
    'empty_basket'      :   "سبد خرید شما خالی است.",
    'deposit'           :   'برای افزایش موجودی به آیدی زیر پیام دهید : \n @Info_MahdiShop',
    'chose_edit'        :   "لطفاً کالای مورد نظر برای ویرایش را انتخاب کنید:",
    'pay'               :   'برای تکمیل خرید پیامی که شامل سبد خرید خود هست را کپی کرده و به آیدی زیر ارسال کنید\n @Info_MahdiShop'
}
